benchmarks/parallel-scaling/openfoam-tgv/case/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);   // overwritten by setExprFields (TGV)

boundaryField
{
    left   { type cyclic; }
    right  { type cyclic; }
    front  { type cyclic; }
    back   { type cyclic; }
    bottom { type cyclic; }
    top    { type cyclic; }
}
