benchmarks/parallel-scaling/openfoam-tgv/case/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    left   { type cyclic; }
    right  { type cyclic; }
    front  { type cyclic; }
    back   { type cyclic; }
    bottom { type cyclic; }
    top    { type cyclic; }
}
