benchmarks/parallel-scaling/openfoam-tgv/case/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     icoFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         @ENDT@;
deltaT          @DT@;
writeControl    timeStep;
writeInterval   1000000;    // benchmark: never write fields
purgeWrite      0;
writeFormat     binary;
runTimeModifiable no;
