benchmarks/parallel-scaling/openfoam-tgv/case/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains @NP@;
method          scotch;
