benchmarks/parallel-scaling/openfoam-tgv/case/system/setExprFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}

// Taylor-Green vortex, one vortex per 2*pi tile (tiles repeat periodically)
expressions
(
    U
    {
        field       U;
        dimensions  [0 1 -1 0 0 0 0];
        expression
        #{
            vector
            (
                 sin(pos().x())*cos(pos().y())*cos(pos().z()),
                -cos(pos().x())*sin(pos().y())*cos(pos().z()),
                 0
            )
        #};
    }
);
